n = int(input('Enter a number: '))      #รับ integer ไปเก็บในตัวแปร n
def check_prime(x):                     #สร้าง ฟังก์ชัน check_prime() ที่รับค่าเข้ามาไว้ในตัวแปร x
    isp = True                          #สร้างตัวแปร isp กำหนดให้มีค่า True ...isp stand for isprime
    count =0                            #สร้างตัวแปร count = 0 
    s=str(x)                            #สร้างตัวแปรสตริง s ที่เก็บค่าที่รับมา ในที่อยู่ที่ตัวแปร x 
    for i in range(1,x+1):              #สร้าง loop for ให้ i นับตั้งแต่ 1 ถึง x (เลยต้องใส่ +1)
        if x%i==0:                      #เช็คว่า x หารด้วย i ได้เศษ 0 หรือไม่ (i ในรอบนั้นๆ) ถ้าใช่ให้ทำด้านล่าง
            count+=1                    #ถ้าใช่ count ก็บวกเพิ่มไป 1
    if count>2 or x==0 or x==1:         #เช็คว่าถ้า count มากกว่า 2 (มีตัวที่หารลงตัวมากกว่า 2) หรือ x = 0 หรือ x = 1 ถ้าใช่ให้ทำด้านล่าง
        s+=' is not a prime number.'    #เพิ่มข้อความ ' is not a prime number.' เข้าไปต่อท้าย ตัวแปร s (ที่ต่อได้เพราะเป็นสตริงเหมือนกัน)
    else:                               #ถ้าไม่เป็นไปตามเงื่อนไขให้ทำด้านล่างนี้
        s+=' is a prime number.'        #เพิ่มข้อความ ' is a prime number.' เข้าไปต่อท้าย ตัวแปร s ...สรุปง่ายๆคือจำนวนเฉพาะคือจำนวนที่หารลงตัวได้แค่ 2 จำนวนคือ 1 กับตัวมันเอง โดยเราใช้ตัวแปร count มานับ
    return(s)                           #ส่งค่าที่ตัวแปร s เก็บอยู่กลับไป 
p = check_prime(n)                      #สร้างตัวแปร p มา โดยส่งค่าที่เก็บไว้ในตัวแปร n ไปในฟังก์ชัน check_prime และเอาค่า s ที่ได้จากฟังก์ชันมาเก็บไว้ใน p
print(p)                                #แสดงค่า p